GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.h
// Register: SMT1CPWU
#define SMT1CPWU SMT1CPWU
extern volatile unsigned char           SMT1CPWU            __at(0x494);
#ifndef _LIB_BUILD
asm("SMT1CPWU equ 0494h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPW                    :8;
    };
    struct {
        unsigned CPW16                  :1;
        unsigned CPW17                  :1;
        unsigned CPW18                  :1;
        unsigned CPW19                  :1;
        unsigned CPW20                  :1;
        unsigned CPW21                  :1;
        unsigned CPW22                  :1;
        unsigned CPW23                  :1;
    };
    struct {
        unsigned SMT1CPW                :8;
    };
    struct {
        unsigned SMT1CPW16              :1;
        unsigned SMT1CPW17              :1;
        unsigned SMT1CPW18              :1;
        unsigned SMT1CPW19              :1;
        unsigned SMT1CPW20              :1;
        unsigned SMT1CPW21              :1;
        unsigned SMT1CPW22              :1;
        unsigned SMT1CPW23              :1;
    };
} SMT1CPWUbits_t;
extern volatile SMT1CPWUbits_t SMT1CPWUbits __at(0x494);
// bitfield macros
#define _SMT1CPWU_CPW_POSN                                  0x0
#define _SMT1CPWU_CPW_POSITION                              0x0
#define _SMT1CPWU_CPW_SIZE                                  0x8
#define _SMT1CPWU_CPW_LENGTH                                0x8
#define _SMT1CPWU_CPW_MASK                                  0xFF
#define _SMT1CPWU_CPW16_POSN                                0x0
#define _SMT1CPWU_CPW16_POSITION                            0x0
#define _SMT1CPWU_CPW16_SIZE                                0x1
#define _SMT1CPWU_CPW16_LENGTH                              0x1
#define _SMT1CPWU_CPW16_MASK                                0x1
#define _SMT1CPWU_CPW17_POSN                                0x1
#define _SMT1CPWU_CPW17_POSITION                            0x1
#define _SMT1CPWU_CPW17_SIZE                                0x1
#define _SMT1CPWU_CPW17_LENGTH                              0x1
#define _SMT1CPWU_CPW17_MASK                                0x2
#define _SMT1CPWU_CPW18_POSN                                0x2
#define _SMT1CPWU_CPW18_POSITION                            0x2
#define _SMT1CPWU_CPW18_SIZE                                0x1
#define _SMT1CPWU_CPW18_LENGTH                              0x1
#define _SMT1CPWU_CPW18_MASK                                0x4
#define _SMT1CPWU_CPW19_POSN                                0x3
#define _SMT1CPWU_CPW19_POSITION                            0x3
#define _SMT1CPWU_CPW19_SIZE                                0x1
#define _SMT1CPWU_CPW19_LENGTH                              0x1
#define _SMT1CPWU_CPW19_MASK                                0x8
#define _SMT1CPWU_CPW20_POSN                                0x4
#define _SMT1CPWU_CPW20_POSITION                            0x4
#define _SMT1CPWU_CPW20_SIZE                                0x1
#define _SMT1CPWU_CPW20_LENGTH                              0x1
#define _SMT1CPWU_CPW20_MASK                                0x10
#define _SMT1CPWU_CPW21_POSN                                0x5
#define _SMT1CPWU_CPW21_POSITION                            0x5
#define _SMT1CPWU_CPW21_SIZE                                0x1
#define _SMT1CPWU_CPW21_LENGTH                              0x1
#define _SMT1CPWU_CPW21_MASK                                0x20
#define _SMT1CPWU_CPW22_POSN                                0x6
#define _SMT1CPWU_CPW22_POSITION                            0x6
#define _SMT1CPWU_CPW22_SIZE                                0x1
#define _SMT1CPWU_CPW22_LENGTH                              0x1
#define _SMT1CPWU_CPW22_MASK                                0x40
#define _SMT1CPWU_CPW23_POSN                                0x7
#define _SMT1CPWU_CPW23_POSITION                            0x7
#define _SMT1CPWU_CPW23_SIZE                                0x1
#define _SMT1CPWU_CPW23_LENGTH                              0x1
#define _SMT1CPWU_CPW23_MASK                                0x80
#define _SMT1CPWU_SMT1CPW_POSN                              0x0
#define _SMT1CPWU_SMT1CPW_POSITION                          0x0
#define _SMT1CPWU_SMT1CPW_SIZE                              0x8
#define _SMT1CPWU_SMT1CPW_LENGTH                            0x8
#define _SMT1CPWU_SMT1CPW_MASK                              0xFF
#define _SMT1CPWU_SMT1CPW16_POSN                            0x0
#define _SMT1CPWU_SMT1CPW16_POSITION                        0x0
#define _SMT1CPWU_SMT1CPW16_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW16_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW16_MASK                            0x1
#define _SMT1CPWU_SMT1CPW17_POSN                            0x1
#define _SMT1CPWU_SMT1CPW17_POSITION                        0x1
#define _SMT1CPWU_SMT1CPW17_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW17_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW17_MASK                            0x2
#define _SMT1CPWU_SMT1CPW18_POSN                            0x2
#define _SMT1CPWU_SMT1CPW18_POSITION                        0x2
#define _SMT1CPWU_SMT1CPW18_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW18_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW18_MASK                            0x4
#define _SMT1CPWU_SMT1CPW19_POSN                            0x3
#define _SMT1CPWU_SMT1CPW19_POSITION                        0x3
#define _SMT1CPWU_SMT1CPW19_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW19_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW19_MASK                            0x8
#define _SMT1CPWU_SMT1CPW20_POSN                            0x4
#define _SMT1CPWU_SMT1CPW20_POSITION                        0x4
#define _SMT1CPWU_SMT1CPW20_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW20_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW20_MASK                            0x10
#define _SMT1CPWU_SMT1CPW21_POSN                            0x5
#define _SMT1CPWU_SMT1CPW21_POSITION                        0x5
#define _SMT1CPWU_SMT1CPW21_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW21_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW21_MASK                            0x20
#define _SMT1CPWU_SMT1CPW22_POSN                            0x6
#define _SMT1CPWU_SMT1CPW22_POSITION                        0x6
#define _SMT1CPWU_SMT1CPW22_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW22_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW22_MASK                            0x40
#define _SMT1CPWU_SMT1CPW23_POSN                            0x7
#define _SMT1CPWU_SMT1CPW23_POSITION                        0x7
#define _SMT1CPWU_SMT1CPW23_SIZE                            0x1
#define _SMT1CPWU_SMT1CPW23_LENGTH                          0x1
#define _SMT1CPWU_SMT1CPW23_MASK                            0x80

// Register: SMT1PR
#define SMT1PR SMT1PR
#ifndef __CCI__
extern volatile __uint24                SMT1PR              __at(0x495);
#endif
#ifndef _LIB_BUILD
asm("SMT1PR equ 0495h");
#endif

