GopalSaraf/Practicals/PSDL/include/proc/pic16f19186.h
// Register: ODCONF
#define ODCONF ODCONF
extern volatile unsigned char           ODCONF              __at(0x1E52);
#ifndef _LIB_BUILD
asm("ODCONF equ 01E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCF0                  :1;
        unsigned ODCF1                  :1;
        unsigned ODCF2                  :1;
        unsigned ODCF3                  :1;
        unsigned ODCF4                  :1;
        unsigned ODCF5                  :1;
        unsigned ODCF6                  :1;
        unsigned ODCF7                  :1;
    };
} ODCONFbits_t;
extern volatile ODCONFbits_t ODCONFbits __at(0x1E52);
// bitfield macros
#define _ODCONF_ODCF0_POSN                                  0x0
#define _ODCONF_ODCF0_POSITION                              0x0
#define _ODCONF_ODCF0_SIZE                                  0x1
#define _ODCONF_ODCF0_LENGTH                                0x1
#define _ODCONF_ODCF0_MASK                                  0x1
#define _ODCONF_ODCF1_POSN                                  0x1
#define _ODCONF_ODCF1_POSITION                              0x1
#define _ODCONF_ODCF1_SIZE                                  0x1
#define _ODCONF_ODCF1_LENGTH                                0x1
#define _ODCONF_ODCF1_MASK                                  0x2
#define _ODCONF_ODCF2_POSN                                  0x2
#define _ODCONF_ODCF2_POSITION                              0x2
#define _ODCONF_ODCF2_SIZE                                  0x1
#define _ODCONF_ODCF2_LENGTH                                0x1
#define _ODCONF_ODCF2_MASK                                  0x4
#define _ODCONF_ODCF3_POSN                                  0x3
#define _ODCONF_ODCF3_POSITION                              0x3
#define _ODCONF_ODCF3_SIZE                                  0x1
#define _ODCONF_ODCF3_LENGTH                                0x1
#define _ODCONF_ODCF3_MASK                                  0x8
#define _ODCONF_ODCF4_POSN                                  0x4
#define _ODCONF_ODCF4_POSITION                              0x4
#define _ODCONF_ODCF4_SIZE                                  0x1
#define _ODCONF_ODCF4_LENGTH                                0x1
#define _ODCONF_ODCF4_MASK                                  0x10
#define _ODCONF_ODCF5_POSN                                  0x5
#define _ODCONF_ODCF5_POSITION                              0x5
#define _ODCONF_ODCF5_SIZE                                  0x1
#define _ODCONF_ODCF5_LENGTH                                0x1
#define _ODCONF_ODCF5_MASK                                  0x20
#define _ODCONF_ODCF6_POSN                                  0x6
#define _ODCONF_ODCF6_POSITION                              0x6
#define _ODCONF_ODCF6_SIZE                                  0x1
#define _ODCONF_ODCF6_LENGTH                                0x1
#define _ODCONF_ODCF6_MASK                                  0x40
#define _ODCONF_ODCF7_POSN                                  0x7
#define _ODCONF_ODCF7_POSITION                              0x7
#define _ODCONF_ODCF7_SIZE                                  0x1
#define _ODCONF_ODCF7_LENGTH                                0x1
#define _ODCONF_ODCF7_MASK                                  0x80

// Register: SLRCONF
#define SLRCONF SLRCONF
extern volatile unsigned char           SLRCONF             __at(0x1E53);
#ifndef _LIB_BUILD
asm("SLRCONF equ 01E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRF0                  :1;
        unsigned SLRF1                  :1;
        unsigned SLRF2                  :1;
        unsigned SLRF3                  :1;
        unsigned SLRF4                  :1;
        unsigned SLRF5                  :1;
        unsigned SLRF6                  :1;
        unsigned SLRF7                  :1;
    };
} SLRCONFbits_t;
extern volatile SLRCONFbits_t SLRCONFbits __at(0x1E53);
// bitfield macros
#define _SLRCONF_SLRF0_POSN                                 0x0
#define _SLRCONF_SLRF0_POSITION                             0x0
#define _SLRCONF_SLRF0_SIZE                                 0x1
#define _SLRCONF_SLRF0_LENGTH                               0x1
#define _SLRCONF_SLRF0_MASK                                 0x1
#define _SLRCONF_SLRF1_POSN                                 0x1
#define _SLRCONF_SLRF1_POSITION                             0x1
#define _SLRCONF_SLRF1_SIZE                                 0x1
#define _SLRCONF_SLRF1_LENGTH                               0x1
#define _SLRCONF_SLRF1_MASK                                 0x2
#define _SLRCONF_SLRF2_POSN                                 0x2
#define _SLRCONF_SLRF2_POSITION                             0x2
#define _SLRCONF_SLRF2_SIZE                                 0x1
#define _SLRCONF_SLRF2_LENGTH                               0x1
#define _SLRCONF_SLRF2_MASK                                 0x4
#define _SLRCONF_SLRF3_POSN                                 0x3
#define _SLRCONF_SLRF3_POSITION                             0x3
#define _SLRCONF_SLRF3_SIZE                                 0x1
#define _SLRCONF_SLRF3_LENGTH                               0x1
#define _SLRCONF_SLRF3_MASK                                 0x8
#define _SLRCONF_SLRF4_POSN                                 0x4
#define _SLRCONF_SLRF4_POSITION                             0x4
#define _SLRCONF_SLRF4_SIZE                                 0x1
#define _SLRCONF_SLRF4_LENGTH                               0x1
#define _SLRCONF_SLRF4_MASK                                 0x10
#define _SLRCONF_SLRF5_POSN                                 0x5
#define _SLRCONF_SLRF5_POSITION                             0x5
#define _SLRCONF_SLRF5_SIZE                                 0x1
#define _SLRCONF_SLRF5_LENGTH                               0x1
#define _SLRCONF_SLRF5_MASK                                 0x20
#define _SLRCONF_SLRF6_POSN                                 0x6
#define _SLRCONF_SLRF6_POSITION                             0x6
#define _SLRCONF_SLRF6_SIZE                                 0x1
#define _SLRCONF_SLRF6_LENGTH                               0x1
#define _SLRCONF_SLRF6_MASK                                 0x40
#define _SLRCONF_SLRF7_POSN                                 0x7
#define _SLRCONF_SLRF7_POSITION                             0x7
#define _SLRCONF_SLRF7_SIZE                                 0x1
#define _SLRCONF_SLRF7_LENGTH                               0x1
#define _SLRCONF_SLRF7_MASK                                 0x80

// Register: INLVLF
#define INLVLF INLVLF
extern volatile unsigned char           INLVLF              __at(0x1E54);
#ifndef _LIB_BUILD
asm("INLVLF equ 01E54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLF0                :1;
        unsigned INLVLF1                :1;
        unsigned INLVLF2                :1;
        unsigned INLVLF3                :1;
        unsigned INLVLF4                :1;
        unsigned INLVLF5                :1;
        unsigned INLVLF6                :1;
        unsigned INLVLF7                :1;
    };
} INLVLFbits_t;
